# Outlier detection using  inter quantile range (IQR)

In [1]:
import pandas as pd
df=pd.read_csv("C:/Users/Admin/Desktop/DYPIEMR data/DSBDA lab/height.csv")

In [2]:
df

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [3]:
df.describe()

             Height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [4]:
q1=df.Height.quantile(0.25)
q3=df.Height.quantile(0.75)
q1,q3

(63.505620480000005, 69.17426172750001)

In [5]:
IQR=q3-q1
IQR

5.668641247500005

In [6]:
lowe_limit=q1-1.5*IQR
upper_limit=q3+1.5*IQR
lowe_limit,upper_limit

(55.00265860875, 77.67722359875002)

In [7]:
#outlier
df[(df.Height<lowe_limit)|(df.Height>upper_limit)]

      Gender     Height
994     Male  78.095867
1317    Male  78.462053
2014    Male  78.998742
3285    Male  78.528210
3757    Male  78.621374
6624  Female  54.616858
7294  Female  54.873728
9285  Female  54.263133

In [8]:
df[(df.Height>lowe_limit)&(df.Height<upper_limit)]

      Gender     Height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9992 rows x 2 columns]

# Detecting using Z score

In [ ]:
z=(x-mean)/standard deviation

In [10]:
df['zscore']=(df.Height - df.Height.mean())/df.Height.std()
df

      Gender     Height    zscore
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[10000 rows x 3 columns]

In [11]:
df[df['zscore']>3]

     Gender     Height    zscore
994    Male  78.095867  3.048271
1317   Male  78.462053  3.143445
2014   Male  78.998742  3.282934
3285   Male  78.528210  3.160640
3757   Male  78.621374  3.184854

In [ ]:
#These all are outliers.

In [25]:
df[df['zscore']<-3]

      Gender     Height    zscore
6624  Female  54.616858 -3.054091
9285  Female  54.263133 -3.146027